{
  "description": "ios Claude workflow gist snapshot",
  "filename": "ios-claude-workflow.md",
  "language": "Markdown",
  "content": "### 1) Prime Claude with `/init`\nI started by running `/init` so Claude reads the repo and rewrites `CLAUDE.md` with real project affordances: how to run one test with `xcodebuild`, where Vice models live, what Swift 6.1 concurrency rules we enforce, and the bundle/CloudKit facts. I cut redundancy, kept only the sharp bits, and verified with CI. This establishes a trustworthy \"ops manual\" Claude sees first, not tribal memory.\n\n**Why**: if the source of truth is precise, agents stop hallucinating paths/flags.\n\n### 2) Level up Claude Code (settings, commands, hooks, nested docs)\nNext pass: I mapped the whole Claude Code surface (settings, slash commands, MCP hooks, status line, nested `CLAUDE.md`s). Then I added:\n\n- `.claude/settings.json` — status line, model prefs, environment, and hook wiring.  \n- Custom commands as the primary UX: small, composable, documented.\n- Hooks for pre/post edit guardrails (formatting, concurrency checks).\n- Nested `CLAUDE.md` per target/package so context is hyper-local and bloat-free.\n\n**Examples**\n\n```text\n/build-device                  # Build+install to a plugged-in device\n/test-single ViceStatsTests    # Run just this class (or test) fast\n/pr-ready                      # Lint, format, unit tests, widget tests\n/swift6-check                  # Strict concurrency audit\n```\n\nOpinion: commands are the product. Don't bury them in a Makefile if Claude is the driver; keep them where the agent looks first.\n\n### 3) Make it self-healing (maintenance commands + policy)\n\nI created /claude-optimize to re-scan the project and suggest upgrades when Claude ships new features, and /update-docs to rewrite all CLAUDE.md files with current paths, commands, and \"last updated\" stamps. I set a light process: run optimize weekly, update docs at sprint end, and before a release. This keeps the doc surface tight without thinking about it.\n\n### 4) Swap raw xcodebuild for MCP (XcodeBuildMCP)\n\nGoal: unified tool calls Claude can drive. I integrated XcodeBuildMCP and removed raw xcodebuild from slash commands.\n\t•\tContext detection (.claude/scripts/detect-context.sh) sets env defaults based on CWD:\n\t•\tIn Packages/ViceKit → use Swift package test tools.\n\t•\tIn app target dirs → pick the main scheme/workspace.\n\t•\tFor widgets → choose the widget scheme.\n\t•\tAuto-select a booted simulator or the newest iPhone.\n\t•\tDynamic tools: I wanted \"dynamic\" discovery; Claude Code doesn't support sampling-based tool discovery yet, so I emulate \"dynamic\" via env + routing (pragmatic, works today).\n\t•\tCommands now call MCP tools exclusively: build, test, run, clean, device/sim ops.\n\n// pseudo mcp server config shell-out\n{\n  \"XcodeBuildMCP\": {\n    \"command\": \"bash\",\n    \"args\": [\"-c\", \"source .claude/scripts/detect-context.sh && npx xcodebuildmcp\"]\n  }\n}\n\nNet effect: one interface, better errors, fewer flags.\n\n### 5) One-shot \"setup prompt\" for any iOS repo\n\nI wrote a master prompt (setup-prompt.md) that recreates the entire system in a new project in one Claude session:\n\t•\tPhase 0: verify prerequisites (Xcode, Node/npm for MCP, Git).\n\t•\tPhase 1: deep analysis (workspace vs project, schemes, packages, tests, Swift version).\n\t•\tPhase 2: scaffold Claude structure (.claude/, nested docs, commands, hooks).\n\t•\tPhase 3: wire XcodeBuildMCP with context detection.\n\t•\tPhase 4–8: create commands, optional hooks/settings, test + verify, and add troubleshooting.\n\nNo assumptions about Make/Rake; the prompt builds what it needs, asks for optional imports if present, and ships with a clear success checklist.\n\n### 6) Tighten the screws (Claude-specific, fewer foot-guns)\n\nFinal pass: removed non-Claude IDE talk, added a real troubleshooting appendix, and clarified that MCP is already available in Claude Code (no extra config files needed there). Hooks and settings are optional but recommended; the context script is mandatory (it's where the magic lives).\n"
}
